export const sectionYearRanges: [number, number][] = [
    [1999, 2004], 
    [1987, 1991], 
    [1992, 1997], 
    [1999, 2004], 
    [1987, 1991],
    [2015, 2022]
];
  
export const textEvents: Record<number, { year: number; text: string }[]> = {
    0: [
        { year: 1999, text: 'Премьера балета «Золушка» в постановке Жан-Кристофа Майо, сценография Эрнеста Пиньона' },
        { year: 2000, text: 'Возобновлено изздание журнала «Театр»' },
        { year: 2001, text: 'Премьера трилогии Тома Стопарда «Берег Утопии», Королевский Национальный театр, Лондон' },
        { year: 2002, text: 'Событие 4' },
        { year: 2003, text: 'Событие 5' },
        { year: 2004, text: 'Событие 6' }
    ],
    1: [
        { year: 1987, text: '«Хищник»/Predator, США (реж. Джон Мактирнан)' },
        { year: 1988, text: '«Кто подставил кролика Роджера»/Who framer Roger Rabbit, США (реж. Роберт Земекис)' },
        { year: 1989, text: '«Назад в будущее 2»/Back to the future 2, США (реж. Роберт Земекис)' },
        { year: 1990, text: '«Крепкий орешек 2»/Die hard 2, США (реж. Ренни Харлин)' },
        { year: 1991, text: '«Семейка Аддамс»/ The Addams Family, США (реж. Барри Зонненфельд)' }
    ],
    2: [
        { year: 1992, text: 'Нобелевская премия по литературе - Дерек Уолкотт «За блестящий образец карибского эпоса в 64 разделах»' },
        { year: 1993, text: '«Бессонница» - роман Стивена Кинга' },
        { year: 1994, text: 'Нобелевская премия по литературе - Шемас Хини' },
        { year: 1995, text: '«Гарри Потер и философский камень», Дж.К. Роулинг' },
        { year: 1996, text: 'Событие 5' },
        { year: 1997, text: 'Событие 6' }
      ],
    3: [
        { year: 1999, text: 'Премьера балета «Золушка» в постановке Жан-Кристофа Майо, сценография Эрнеста Пиньона' },
        { year: 2000, text: 'Возобновлено изздание журнала «Театр»' },
        { year: 2001, text: 'Премьера трилогии Тома Стопарда «Берег Утопии», Королевский Национальный театр, Лондон' },
        { year: 2002, text: 'Событие 4' },
        { year: 2003, text: 'Событие 5' },
        { year: 2004, text: 'Событие 6' }
    ],
    4: [
        { year: 1987, text: '«Хищник»/Predator, США (реж. Джон Мактирнан)' },
        { year: 1988, text: '«Кто подставил кролика Роджера»/Who framer Roger Rabbit, США (реж. Роберт Земекис)' },
        { year: 1989, text: '«Назад в будущее 2»/Back to the future 2, США (реж. Роберт Земекис)' },
        { year: 1990, text: '«Крепкий орешек 2»/Die hard 2, США (реж. Ренни Харлин)' },
        { year: 1991, text: '«Семейка Аддамс»/ The Addams Family, США (реж. Барри Зонненфельд)' }
    ],
    5: [
        { year: 2015, text: '13 сентября - частое солнечное затмение, видимое в Южной Африке и части Антарктиды' },
        { year: 2016, text: 'Телескоп «Хаббл» обнаружил самую удаленную из всех обнаруженных галактик, получившую обозначение GN-z11' },
        { year: 2017, text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi' },
        { year: 2018, text: 'Старт космического аппарата Solar Probe Plus, предназначенного для изучения солнца' },
        { year: 2019, text: 'Google объявил о создании 53-кубитного квантового компьютера' },
        { year: 2020, text: 'Корабль Crew Dragon вернулся на Землю из первого пилотируемого полета' },
        { year: 2021, text: 'Событие 7' },
        { year: 2022, text: 'Событие 8' }
    ],
};